In [9]:
import pandas as pd

# 売上データのcsvファイルの読込み
df_log = pd.read_table('data/product_log.tsv')
df_log.head()

         Date  Num Product
0  2017-01-03  1.0       B
1  2017-01-06  2.0       B
2  2017-01-07  1.0       A
3  2017-01-11  2.0       A
4  2017-01-12  2.0       B

In [10]:
len(df_log)

40

In [11]:
# shape はデータの形状を表します。DataFrame では（行数,列数）になります
df_log.shape

(40, 3)

In [12]:
# サマリ表示
df_log_describe = df_log.describe()
df_log_describe

             Num
count  36.000000
mean    3.583333
std     1.421770
min     1.000000
25%     2.000000
50%     4.000000
75%     4.250000
max     6.000000

In [13]:
# 四分位数の代わりに  30%点と60%点を表示します
df_log.describe([0.3, 0.6])

             Num
count  36.000000
mean    3.583333
std     1.421770
min     1.000000
30%     3.000000
50%     4.000000
60%     4.000000
max     6.000000

In [14]:
# 50%点は必ず表示されます
df_log.describe([])

             Num
count  36.000000
mean    3.583333
std     1.421770
min     1.000000
50%     4.000000
max     6.000000

In [15]:
#デフォルトでは、数値のみ表示されますが、include='all' で数値以外も表示されます
# uniqueは重複を除いた種類数を、freqは最頻値の個数を表示します
# Dateのtopは、（setを使っているため）表示が変わることがあるのでご注意ください
df_log.describe(include='all')

              Date        Num Product
count           40  36.000000      40
unique          40        NaN       2
top     2017-02-26        NaN       A
freq             1        NaN      21
mean           NaN   3.583333     NaN
std            NaN   1.421770     NaN
min            NaN   1.000000     NaN
25%            NaN   2.000000     NaN
50%            NaN   4.000000     NaN
75%            NaN   4.250000     NaN
max            NaN   6.000000     NaN